spec/support/vcr_cassettes/hca/short_form.yml

---
http_interactions:
- request:
    method: post
    uri: <%= Settings.hca.endpoint %>
    body:
      encoding: UTF-8
      string: <?xml version="1.0" encoding="UTF-8"?><soap:Envelope xmlns:xsd="http://www.w3.org/2001/XMLSchema"
        xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:ns1="http://va.gov/schema/esr/voa/v1"
        xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/" xmlns:tns="http://va.gov/service/esr/voa/v1"><soap:Body><ns1:submitFormRequest><va:form
        xmlns:va="http://va.gov/schema/esr/voa/v1"><va:formIdentifier><va:type>100</va:type><va:value>1010EZ</va:value><va:version>2986360436</va:version></va:formIdentifier><va:summary><eeSummary:demographics
        xmlns:eeSummary="http://jaxws.webservices.esr.med.va.gov/schemas"><eeSummary:appointmentRequestResponse>true</eeSummary:appointmentRequestResponse><eeSummary:contactInfo><eeSummary:addresses><eeSummary:address><eeSummary:city>Ontario</eeSummary:city><eeSummary:country>CAN</eeSummary:country><eeSummary:line1>123
        NW 5th St</eeSummary:line1><eeSummary:provinceCode>ON</eeSummary:provinceCode><eeSummary:postalCode>21231</eeSummary:postalCode><eeSummary:addressTypeCode>P</eeSummary:addressTypeCode></eeSummary:address></eeSummary:addresses><eeSummary:emails><eeSummary:email><eeSummary:address>foo@example.com</eeSummary:address><eeSummary:type>1</eeSummary:type></eeSummary:email></eeSummary:emails><eeSummary:phones><eeSummary:phone><eeSummary:phoneNumber>1231241234</eeSummary:phoneNumber><eeSummary:type>1</eeSummary:type></eeSummary:phone><eeSummary:phone><eeSummary:phoneNumber>1235551234</eeSummary:phoneNumber><eeSummary:type>4</eeSummary:type></eeSummary:phone></eeSummary:phones></eeSummary:contactInfo><eeSummary:ethnicity>2135-2</eeSummary:ethnicity><eeSummary:maritalStatus>U</eeSummary:maritalStatus><eeSummary:preferredFacility>608</eeSummary:preferredFacility><eeSummary:races><eeSummary:race>1002-5</eeSummary:race><eeSummary:race>2028-9</eeSummary:race><eeSummary:race>2054-5</eeSummary:race><eeSummary:race>2076-8</eeSummary:race><eeSummary:race>2106-3</eeSummary:race></eeSummary:races><eeSummary:acaIndicator>false</eeSummary:acaIndicator></eeSummary:demographics><eeSummary:enrollmentDeterminationInfo
        xmlns:eeSummary="http://jaxws.webservices.esr.med.va.gov/schemas"><eeSummary:eligibleForMedicaid>false</eeSummary:eligibleForMedicaid><eeSummary:noseThroatRadiumInfo><eeSummary:receivingTreatment>true</eeSummary:receivingTreatment></eeSummary:noseThroatRadiumInfo><eeSummary:serviceConnectionAward><eeSummary:serviceConnectedIndicator>true</eeSummary:serviceConnectedIndicator></eeSummary:serviceConnectionAward><eeSummary:specialFactors><eeSummary:agentOrangeInd>true</eeSummary:agentOrangeInd><eeSummary:envContaminantsInd>true</eeSummary:envContaminantsInd><eeSummary:campLejeuneInd>true</eeSummary:campLejeuneInd><eeSummary:radiationExposureInd>true</eeSummary:radiationExposureInd></eeSummary:specialFactors></eeSummary:enrollmentDeterminationInfo><eeSummary:financialsInfo
        xmlns:eeSummary="http://jaxws.webservices.esr.med.va.gov/schemas"><eeSummary:incomeTest><eeSummary:discloseFinancialInformation>false</eeSummary:discloseFinancialInformation></eeSummary:incomeTest></eeSummary:financialsInfo><eeSummary:insuranceList
        xmlns:eeSummary="http://jaxws.webservices.esr.med.va.gov/schemas"><eeSummary:insurance><eeSummary:companyName>MyInsruance</eeSummary:companyName><eeSummary:policyHolderName>FirstName
        ZZTEST</eeSummary:policyHolderName><eeSummary:policyNumber>P1234</eeSummary:policyNumber><eeSummary:groupNumber>G1234</eeSummary:groupNumber><eeSummary:insuranceMappingTypeName>PI</eeSummary:insuranceMappingTypeName></eeSummary:insurance></eeSummary:insuranceList><eeSummary:militaryServiceInfo
        xmlns:eeSummary="http://jaxws.webservices.esr.med.va.gov/schemas"><eeSummary:dischargeDueToDisability>true</eeSummary:dischargeDueToDisability><eeSummary:militaryServiceSiteRecords><eeSummary:militaryServiceSiteRecord><eeSummary:site>608</eeSummary:site></eeSummary:militaryServiceSiteRecord></eeSummary:militaryServiceSiteRecords></eeSummary:militaryServiceInfo><eeSummary:prisonerOfWarInfo
        xmlns:eeSummary="http://jaxws.webservices.esr.med.va.gov/schemas"><eeSummary:powIndicator>true</eeSummary:powIndicator></eeSummary:prisonerOfWarInfo><eeSummary:purpleHeart
        xmlns:eeSummary="http://jaxws.webservices.esr.med.va.gov/schemas"><eeSummary:indicator>false</eeSummary:indicator></eeSummary:purpleHeart><eeSummary:personInfo
        xmlns:eeSummary="http://jaxws.webservices.esr.med.va.gov/schemas"><eeSummary:firstName>FIRSTNAME</eeSummary:firstName><eeSummary:middleName>MIDDLENAME</eeSummary:middleName><eeSummary:lastName>ZZTEST</eeSummary:lastName><eeSummary:suffix>JR.</eeSummary:suffix><eeSummary:gender>F</eeSummary:gender><eeSummary:dob>01/02/1923</eeSummary:dob><eeSummary:mothersMaidenName>Maiden</eeSummary:mothersMaidenName><eeSummary:placeOfBirthCity>Springfield</eeSummary:placeOfBirthCity><eeSummary:placeOfBirthState>AK</eeSummary:placeOfBirthState><eeSummary:ssnText>111111234</eeSummary:ssnText></eeSummary:personInfo></va:summary><va:applications><va:applicationInfo><va:appDate>2022-03-16</va:appDate><va:appMethod>1</va:appMethod></va:applicationInfo></va:applications></va:form><va:identity
        xmlns:va="http://va.gov/schema/esr/voa/v1"><va:authenticationLevel><va:type>100</va:type><va:value>anonymous</va:value></va:authenticationLevel></va:identity></ns1:submitFormRequest></soap:Body></soap:Envelope>
    headers:
      Accept:
      - text/xml;charset=UTF-8
      Content-Type:
      - text/xml;charset=UTF-8
      User-Agent:
      - Vets.gov Agent
      Date:
      - Wed, 16 Mar 2022 20:01:14 GMT
      Content-Length:
      - '5285'
      Accept-Encoding:
      - gzip;q=1.0,deflate;q=0.6,identity;q=0.3
  response:
    status:
      code: 200
      message: OK
    headers:
      Date:
      - Wed, 16 Mar 2022 20:01:15 GMT
      Server:
      - Apache/2.4.6 (Red Hat Enterprise Linux) OpenSSL/1.0.2k-fips
      Strict-Transport-Security:
      - max-age=31536000; includeSubDomains; preload
      X-Frame-Options:
      - SAMEORIGIN
      Content-Security-Policy:
      - 'default-src https: data: ''unsafe-inline'' ''unsafe-eval'''
      X-Oracle-Dms-Ecid:
      - 3d5b1d73-103f-4bfa-9abf-90dc7df1bc3d-0000cf22
      X-Oracle-Dms-Rid:
      - '0'
      Ssl-Env:
      - 'On'
      X-Xss-Protection:
      - 1; mode=block
      X-Content-Type-Options:
      - nosniff
      Cache-Control:
      - max-age=0, no-store
      Transfer-Encoding:
      - chunked
      Content-Type:
      - text/xml; charset=utf-8
    body:
      encoding: UTF-8
      string: <?xml version='1.0' encoding='UTF-8'?><S:Envelope xmlns:S="http://schemas.xmlsoap.org/soap/envelope/"><S:Body><submitFormResponse
        xmlns="http://va.gov/schema/esr/voa/v1" xmlns:ns0="http://jaxws.webservices.esr.med.va.gov/schemas"><status>100</status><formSubmissionId>424181437</formSubmissionId><message><type>Form
        successfully received for EE processing</type></message><timeStamp>2022-03-16T15:01:16.459-05:00</timeStamp></submitFormResponse></S:Body></S:Envelope>
  recorded_at: Wed, 16 Mar 2022 20:01:16 GMT
recorded_with: VCR 6.1.0
